OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/USBH_SecureISP/ProcessCommand.c
/**************************************************************************//**
 * @file     ProcessCommand.c
 * @version  V1.00
 * $Revision: 1 $
 * @brief    Transmit command to SecureISP USB command mode.
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#include <stdio.h>
#include <string.h>
#include "stdlib.h"
#include "NuMicro.h"

#include "usbh_lib.h"
#include "usbh_hid.h"

//#define DBG     printf

#ifndef DBG
    #define DBG(...)
#endif

#define CMD_CONNECT                 0x80
#define CMD_RESET                   0x81
#define CMD_WRITE                   0x83
#define CMD_ERASE                   0x84
#define CMD_GET_ID                  0x85

#define CMD_ECDH_PUB0               0x8600
#define CMD_ECDH_PUB1               0x8601
#define CMD_ECDH_GET_PUB0           0x8602
#define CMD_ECDH_GET_PUB1           0x8603
#define CMD_ECDH_RAND_PUB0          0x8604
#define CMD_ECDH_RAND_PUB1          0x8605
#define CMD_ECDH_GET_RAND_PUB0      0x8606
#define CMD_ECDH_GET_RAND_PUB1      0x8607

#define CMD_VENDOR_FUNC             0x8F00
#define CMD_RESYNC                  0x8000


#define ERR_CMD_CHECKSUM            0x7D
#define ERR_CMD_PACKET_NUM          0x50

void Hex2Reg(char input[], uint32_t volatile reg[]);
void Reg2Hex(int32_t count, uint32_t volatile reg[], char output[]);
/* These functions are for process USBH read and write function */
void int_read_callback(HID_DEV_T *hdev, uint16_t ep_addr, int status, uint8_t *rdata, uint32_t data_len);
void int_write_callback(HID_DEV_T *hdev, uint16_t ep_addr, int staus, uint8_t *wbuff, uint32_t *data_len);

volatile HID_DEV_T  *g_pHDEV;

volatile uint32_t   g_u32TmpBuf[1024]; // 4K byte temp buffer

static uint32_t sysGetNum(void);


/* Maximum 64-bytes */
typedef struct
{
    /* Word-0 */
    uint16_t        u16CCITT;       /* CCITT checksum of from u8CmdID to Word-13 */
    uint16_t        u16CmdID;       /* Command ID */

    /* Word-1 */
    uint16_t        u16PacketID;    /* Packet ID */
    uint16_t        u16Len;         /* Valid data length in command data field */

    /* Word-2 ~ 13 */
    uint32_t        au32Data[12];   /* Command data */

    /* Word-14 */
    uint32_t        u32CRC32;       /* CRC32 from Word-0 to Word-13 for check cmd integrity */

    /* Word-15 */
    uint32_t        RSVD;           /* Reserved */

} CMD_PACKET_T;

typedef struct
{
    uint32_t        au32Key0[8];    /* 256-bits */
    uint32_t        au32Key1[8];    /* 256-bits */
} ECC_PUBKEY_T;


typedef struct
{
    uint32_t        u32CmdMask;

    uint32_t        u32PID;
    uint32_t        u32CID;
    uint32_t        u32DID;
    uint32_t        au32UID[3];
    uint32_t        au32UCID[4];

    uint32_t        au32AESIV[4];       /* AES IV, 128-bits */
    uint32_t        au32AESKey[8];      /* AES-256 keys */

    uint32_t        u32KPKEYSTS;
    uint32_t        u32KPCNTSTS;

    ECC_PUBKEY_T    ServerPubKey;       /* Server's ECC public key, 64-bytes (256-bits + 256-bits) */
    ECC_PUBKEY_T    ClientPubKey;       /* Client's ECC public key, 64-bytes (256-bits + 256-bits) */

    volatile uint32_t u32IsRXReady;

    char            d[68];
    char            Qx[68];
    char            Qy[68];
    char            KeyZ[68];
    uint32_t        au32Tmp[FMC_FLASH_PAGE_SIZE / 4];
} CHIP_ISP_INFO_T;


__ALIGNED(4) CHIP_ISP_INFO_T g_ChipISPInfo;
__ALIGNED(4) CMD_PACKET_T    g_WriteCmd;
__ALIGNED(4) CMD_PACKET_T    g_ReturnData;


void  int_read_callback(HID_DEV_T *hdev, uint16_t ep_addr, int status, uint8_t *rdata, uint32_t data_len)
{
    /*
     *  USB host HID driver notify user the transfer status via <status> parameter. If the
     *  If <status> is 0, the USB transfer is fine. If <status> is not zero, this interrupt in
     *  transfer failed and HID driver will stop this pipe. It can be caused by USB transfer error
     *  or device disconnected.
     */
    if (status < 0)
    {
        DBG("Interrupt in transfer failed! status: %d\n", status);
        return;
    }

    memcpy((void *)&g_ReturnData, (void *)rdata, data_len);

    g_ChipISPInfo.u32IsRXReady = 0x5A5A;
}

void  int_write_callback(HID_DEV_T *hdev, uint16_t ep_addr, int staus, uint8_t *wbuff, uint32_t *data_len)
{
    //printf("[%s] ep_addr: 0x%X\n", __func__, ep_addr);
    memcpy(wbuff, (uint8_t *)&g_WriteCmd, sizeof(g_WriteCmd)); /* Fill data to be sent via interrupt out pipe     */
    *data_len = sizeof(g_WriteCmd);
}

void CRYPTO_IRQHandler()
{
    ECC_Complete(CRYPTO);
}

static uint32_t Swap32(uint32_t val)
{
    return (val << 24) | ((val << 8) & 0xff0000) | ((val >> 8) & 0xff00) | (val >> 24);
}

static void BytesSwap(char *buf, int32_t len)
{
    int32_t i;
    char    tmp;

    for (i = 0; i < (len / 2); i++)
    {
        tmp = buf[len - i - 1];
        buf[len - i - 1] = buf[i];
        buf[i] = tmp;
    }
}

__attribute__((unused)) static int32_t _strkeycmp(char *str1, char *str2)
{
    int32_t len1, len2;
    int32_t i;
    char ch1, ch2;

    len1 = strlen(str1);
    len2 = strlen(str2);

    if (len1 != len2)
        return -1;

    for (i = 0; i < len1; i++)
    {
        ch1 = str1[i];
        ch2 = str2[i];
        ch1 = ((ch1 >= 'a') && (ch1 <= 'f')) ? (ch1 + 'A' - 'a') : (ch1);
        ch2 = ((ch2 >= 'a') && (ch2 <= 'f')) ? (ch2 + 'A' - 'a') : (ch2);

        if (ch1 != ch2)
            return -1;
    }

    return 0;

}

char My_GetChar(void)
{
    while (1)
    {
        if ((DEBUG_PORT->FIFOSTS & UART_FIFOSTS_RXEMPTY_Msk) == 0U)
        {
            return ((char)DEBUG_PORT->DAT);
        }
    }
}
static uint32_t sysGetNum(void)
{
    uint32_t i = 0;
    uint8_t InChar = 0x0, InString[16] = {0};

    while (InChar != 0x0D)
    {
        InChar = My_GetChar();

        if (InChar == 27)
        {
            return InChar;
        }

        if (InChar == 'x' || InChar == 'X' || InChar == 'f' ||
                InChar == 'F' || InChar == 'r' || InChar == 'R')
        {
            return InChar;
        }

        if (InChar == '-')
        {
            InString[i] = InChar;
            printf("%c", InChar);
            i++;
        }
        else if ((InChar >= '0') && (InChar <= '9'))
        {
            InString[i] = InChar;
            printf("%c", InChar);
            i++;
        }
    }

    printf("\n");

    return atoi((const char *)InString);
}

