OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/USBH_SecureISP/ProcessCommand.c
/*
    * CCITT (0xFFFF)
    * mode: 0: calculate; 1: verify
*/
static uint16_t _Perform_CCITT(uint32_t *pu32buf, uint16_t len, uint8_t mode)
{
    volatile uint16_t   i;
    uint16_t            *pu16buf, u32OrgSum, u32CalSum;

    if (len > 56) // valid data byte count
        return -1;

    pu16buf = (uint16_t *)pu32buf;

    CLK_EnableModuleClock(CRC0_MODULE);
    CRC_Open(CRC_CCITT, 0, 0xFFFFul, CRC_CPU_WDATA_16);

    for (i = 1; i < (len / 2); i++)
        CRC->DAT = *(pu16buf + i);

    u32OrgSum = *(pu16buf + 0);
    u32CalSum = (CRC->CHECKSUM & 0xFFFFul);

    /* Clear CRC checksum */
    CRC->SEED = 0xFFFFul;
    CRC->CTL |= CRC_CTL_CHKSINIT_Msk;

    if (mode == 0)
    {
        *(pu16buf + 0) = u32CalSum;
        return u32CalSum;
    }
    else if (mode == 1)
    {
        /* Verify CCITT checksum */
        if (u32OrgSum == u32CalSum)
            return 0;   /* Verify CCITT Pass */
        else
            return -1;  /* Verify CCITT Fail */
    }
    else
    {
        return -1;
    }
}

/*
    * CRC32
    * mode: 0: calculate; 1: verify
*/
static uint32_t _Perform_CRC32(uint32_t *pu32buf, uint16_t len, uint8_t mode)
{
    uint16_t i;
    uint32_t u32OrgSum, u32CalSum;

    if (len > 60) // valid data byte count
        return -1;

    CLK_EnableModuleClock(CRC0_MODULE);
    CRC_Open(CRC_32, (CRC_WDATA_RVS | CRC_CHECKSUM_COM | CRC_CHECKSUM_RVS), 0xFFFFFFFFul, CRC_CPU_WDATA_32);

    for (i = 0; i < (len / 4) - 1; i++)
        CRC->DAT = *(pu32buf + i);

    u32OrgSum = *(pu32buf + i);
    u32CalSum = (CRC->CHECKSUM & 0xFFFFFFFFul);

    /* Clear CRC checksum */
    CRC->SEED = 0xFFFFFFFFul;
    CRC->CTL |= CRC_CTL_CHKSINIT_Msk;

    if (mode == 0)
    {
        *(pu32buf + i) = u32CalSum;
        return u32CalSum;
    }
    else if (mode == 1)
    {
        /* Verify CRC32 checksum */
        if (u32OrgSum == u32CalSum)
            return 0;   /* Verify CRC32 Pass */
        else
            return -1;  /* Verify CRC32 Fail */
    }
    else
    {
        return -1;
    }
}

//    //key = "a000000000000000000000000000000000000000000000000000000000000001"
//    //CRYPTO->AES0_KEY[0] = 0xa0000000;
//    //CRYPTO->AES0_KEY[1] = 0x00000000;
//    //CRYPTO->AES0_KEY[2] = 0x00000000;
//    //CRYPTO->AES0_KEY[3] = 0x00000000;
//    //CRYPTO->AES0_KEY[4] = 0x00000000;
//    //CRYPTO->AES0_KEY[5] = 0x00000000;
//    //CRYPTO->AES0_KEY[6] = 0x00000000;
//    //CRYPTO->AES0_KEY[7] = 0x00000001;
//
//    //iv = "1000000000000000000000000000000a"
//    //CRYPTO->AES0_IV[0] = 0x10000000;
//    //CRYPTO->AES0_IV[1] = 0x00000000;
//    //CRYPTO->AES0_IV[2] = 0x00000000;
//    //CRYPTO->AES0_IV[3] = 0x0000000a;
/**
  * @brief      Perform AES-256 CFB NoPadding encrypt
  */
static int32_t _AES256Encrypt(uint32_t *in, uint32_t *out, uint32_t len, uint32_t *KEY, uint32_t *IV)
{
    volatile int32_t    i;
    uint32_t u32TimeOutCnt;

    /* KEY and IV are byte order (32 bit) reversed, Swap32(x)) and stored in ISP_INFO_T */
    memcpy((void *)&CRYPTO->AES_KEY[0], KEY, (4 * 8));
    memcpy((void *)&CRYPTO->AES_IV[0], IV, (4 * 4));

    CRYPTO->AES_SADDR = (uint32_t)in;
    CRYPTO->AES_DADDR = (uint32_t)out;
    CRYPTO->AES_CNT   = len;
    CRYPTO->AES_CTL = ((AES_KEY_SIZE_256 << CRYPTO_AES_CTL_KEYSZ_Pos) | (AES_IN_OUT_SWAP << CRYPTO_AES_CTL_OUTSWAP_Pos));
    CRYPTO->AES_CTL |= (CRYPTO_AES_CTL_ENCRYPTO_Msk);
    CRYPTO->AES_CTL |= ((AES_MODE_CFB << CRYPTO_AES_CTL_OPMODE_Pos) | CRYPTO_AES_CTL_START_Msk | CRYPTO_AES_CTL_DMAEN_Msk);
    u32TimeOutCnt = SystemCoreClock; /* 1 second time-out */

    while (CRYPTO->AES_STS & CRYPTO_AES_STS_BUSY_Msk)
    {
        if (--u32TimeOutCnt == 0)
            return -1;
    }

    return 0;
}

/**
  * @brief      Perform AES-256 CFB NoPadding decrypt
  */
static int32_t _AES256Decrypt(uint32_t *in, uint32_t *out, uint32_t len, uint32_t *KEY, uint32_t *IV)
{
    volatile int32_t    i;
    uint32_t u32TimeOutCnt;

    /* KEY and IV are byte order (32 bit) reversed, Swap32(x)) and stored in ISP_INFO_T */
    memcpy((void *)&CRYPTO->AES_KEY[0], KEY, (4 * 8));
    memcpy((void *)&CRYPTO->AES_IV[0], IV, (4 * 4));

    CRYPTO->AES_SADDR = (uint32_t)in;
    CRYPTO->AES_DADDR = (uint32_t)out;
    CRYPTO->AES_CNT   = len;
    CRYPTO->AES_CTL = ((AES_KEY_SIZE_256 << CRYPTO_AES_CTL_KEYSZ_Pos) | (AES_IN_OUT_SWAP << CRYPTO_AES_CTL_OUTSWAP_Pos));
    CRYPTO->AES_CTL |= ((AES_MODE_CFB << CRYPTO_AES_CTL_OPMODE_Pos) | CRYPTO_AES_CTL_START_Msk | CRYPTO_AES_CTL_DMAEN_Msk);
    u32TimeOutCnt = SystemCoreClock; /* 1 second time-out */

    while (CRYPTO->AES_STS & CRYPTO_AES_STS_BUSY_Msk)
    {
        if (--u32TimeOutCnt == 0)
            return -1;
    }

    return 0;
}

static int32_t _Perform_GenPacket(CMD_PACKET_T *pCMD)
{
    volatile int32_t    i;

#if (0)
    {
        uint32_t *pu32;
        pu32 = (uint32_t *)pCMD;
        DBG("Raw RSP data:\n");

        for (i = 0; i < 2; i++)
            DBG("   0x%08x", pu32[i]);

        for (i = 2; i < sizeof(CMD_PACKET_T) / 4; i++)
        {
            if ((i % 4) == 2)
                DBG("\n");

            DBG("   0x%08x", pu32[i]);
        }

        DBG("\n");
    }
#endif
    /* Generate CCITT */
    _Perform_CCITT((uint32_t *)pCMD, sizeof(CMD_PACKET_T) - 8, 0);

    for (i = 0; i < sizeof(g_ChipISPInfo.au32AESKey) / 4; i++)
    {
        if (g_ChipISPInfo.au32AESKey[i] != 0x0ul)
            break;
    }

    /* if i == 8, NO AES key, do not encrypt the cmd data */
    if (i == 8)
    {
        DBG("\nDo not encrypt cmd data. \n");
    }
    else
    {
        if (_AES256Encrypt(pCMD->au32Data, pCMD->au32Data, sizeof(pCMD->au32Data), g_ChipISPInfo.au32AESKey, g_ChipISPInfo.au32AESIV) < 0)
        {
            return -1;
        }
    }

#if (0)
    {
        uint32_t *pu32;
        pu32 = (uint32_t *)pCMD;
        DBG("AES KEY:\n");

        for (i = 0; i < sizeof(pISPInfo->au32AESKey) / 4; i++)
            DBG("   0x%08x", pISPInfo->au32AESKey[i]);

        DBG("\nAES IV:\n");

        for (i = 0; i < sizeof(pISPInfo->au32AESIV) / 4; i++)
            DBG("   0x%08x", pISPInfo->au32AESIV[i]);

        DBG("\nRSP data(encryption?):\n");

        for (i = 0; i < 2; i++)
            DBG("   0x%08x", pu32[i]);

        for (i = 2; i < sizeof(CMD_PACKET_T) / 4; i++)
        {
            if ((i % 4) == 2)
                DBG("\n");

            DBG("   0x%08x", pu32[i]);
        }

