OpenNuvoton/M55M1BSP/SampleCode/SecureApplication/USBH_SecureISP/ProcessCommand.c
        if (u32Item == 0)
        {
            if ((i32RetCode = Process_GetID()) != 0)
            {
                printf("\n(%d@%s) Process_GetID FAIL (%d) !\n", __LINE__, __FILE__, i32RetCode);

                while (1) {}
            }
        }

        if (u32Item == 1)
        {
            if ((i32RetCode = Process_EraseFlash(u32FlashStartAddr, u32FlashPageCnt)) != 0)
            {
                printf("\n(%d@%s) Process_EraseFlash FAIL (%d) !\n", __LINE__, __FILE__, i32RetCode);

                while (1) {}
            }
        }

        if (u32Item == 2)
        {
            i = j = 0;

            do
            {
                for (i = 0; i < (32 / 4); i++)
                {
                    g_ChipISPInfo.au32Tmp[i] = 0x5a5a0000 + i + (j / 4);
                }

                if ((i32RetCode = Process_WriteFlash((u32FlashStartAddr + j), 32, g_ChipISPInfo.au32Tmp)) != 0)
                {
                    printf("\n(%d@%s) Process_WriteFlash FAIL (%d) !\n", __LINE__, __FILE__, i32RetCode);

                    while (1) {}
                }

                j += 32;
            } while ((u32FlashStartAddr + j) < u32FlashEndAddr);
        }

        if (u32Item == 3)
        {
            u32CmdID = 0x1000;
            g_ChipISPInfo.au32Tmp[0] = (4 * 1);     // vendor cmd: byte counts
            g_ChipISPInfo.au32Tmp[1] = u32CmdID;    // vendor cmd: command ID

            if ((i32RetCode = Process_VendorFunc(g_ChipISPInfo.au32Tmp)) != 0)
            {
                printf("\n(%d@%s) Vendor cmd:0x%x FAIL (%d) !\n", __LINE__, __FILE__, u32CmdID, i32RetCode);

                while (1) {}
            }
        }

        if (u32Item == 4)
        {
            u32CmdID = 0x2000;
            i = j = 0;

            do
            {
                g_ChipISPInfo.au32Tmp[0] = (4 * 3);                     // vendor cmd: byte counts
                g_ChipISPInfo.au32Tmp[1] = u32CmdID;                    // vendor cmd: command ID
                g_ChipISPInfo.au32Tmp[2] = (u32FlashStartAddr + j);     // vendor cmd: addr
                g_ChipISPInfo.au32Tmp[3] = 32;                          // vendor cmd: read byte size

                if ((i32RetCode = Process_VendorFunc(g_ChipISPInfo.au32Tmp)) != 0)
                {
                    printf("\n(%d@%s) Vendor cmd:0x%x FAIL (%d) ! (Addr:0x%x) \n", __LINE__, __FILE__, u32CmdID, i32RetCode, (uint32_t)(u32FlashStartAddr + j));

                    while (1) {}
                }

                j += 32;
            } while ((u32FlashStartAddr + j) < u32FlashEndAddr);
        }

        if (u32Item == 5)
        {
            u32CmdID = 0x3000;
            i = j = 0;

            do
            {
                g_ChipISPInfo.au32Tmp[0] = (4 * 11);                    // vendor cmd: byte counts
                g_ChipISPInfo.au32Tmp[1] = u32CmdID;                    // vendor cmd: command ID
                g_ChipISPInfo.au32Tmp[2] = (u32FlashStartAddr + j);     // vendor cmd: addr
                g_ChipISPInfo.au32Tmp[3] = 32;                          // vendor cmd: write byte size

                for (i = 0; i < (32 / 4); i++)
                {
                    g_ChipISPInfo.au32Tmp[4 + i] = 0x0000a5a5 + ((i + (j / 4)) << 16);
                }

                if ((i32RetCode = Process_VendorFunc(g_ChipISPInfo.au32Tmp)) != 0)
                {
                    printf("\n(%d@%s) Vendor cmd:0x%x FAIL (%d) ! (Addr:0x%x)\n", __LINE__, __FILE__, u32CmdID, i32RetCode, (uint32_t)(u32FlashStartAddr + j));


                    while (1) {}
                }

                j += 32;
            } while ((u32FlashStartAddr + j) < u32FlashEndAddr);
        }

        if (u32Item == 90)
        {
            if (Process_ResetDevice() == 0)
            {
                delay_us(1000000);
                SYS_ResetChip();
                break;
            }
        }
    }

    return 0;
}

/*** (C) COPYRIGHT 2020 Nuvoton Technology Corp. ***/
